{
    "about": {
        "name": "JM Hore",
        "title": "Front-End Web Developer and Designer",
        "description": "I'm a junior front-end web developer with a passion for turning creative ideas into engaging websites. During my free time, I immense myself in strategy and competitive games. I believe that coding provides endless innovations."
        },
    "works": [
        {
            "name": "Portfolio",
            "overview": "Portfolio built primarly using React JS and Javascript Libraries, such as Vanta Js by strikingly.com. Showcasing my latest works as a certified junior web developer which includes a movie database and mockup wordpress site.",
            "features": [
                {
                    "name": "JSON File",
                    "about": "Custom JSON file containing data to be dynamically display on the website. ",
                    "reflection": "A custom JSON file is a accessible and convenient way to store all relevant data. Using the useEffect function to grab the relevant data and display it on how I see fit. I believe it is really useful to have all the data in one file just in case if I need to add or remove content I can find it easily."
                },
                {
                    "name": "Vanta.js",
                    "about": "Javascript library of animated and interactable background, by strinkingly.com",
                    "reflection": "This Javascript library added interactive background which adds an appeal sight to my website."
                }
            ],
            "id": "portfolio",
            "coding": [
                {
                    "name": "React JS",
                    "url": ""
                },
                {
                    "name": "Sass",
                    "url": ""
                },
                {
                    "name": "Vanta.js",
                    "url": ""
                },
                {
                    "name": "Custom JSON File",
                    "url": ""
                }
            ],
            "backdrop": true,
            "available": true,
            "github": "https://github.com/jmfwdev/porfolio"
        },
        {
            "name": "Movie Database",
            "overview": "A movie database built using React JS.",
            "features": [
                {
                    "name": "Web API",
                    "about": "Web API to grab movies to be outputed and featured on a dynamic website.",
                    "reflection": "Using TMDB API I made my own movie database showing all sorts of movies from trending to top-rated."
                }
            ],
            "id": "movie-database",
            "url": "https://jmfw.dev/spade",
            "coding": [
                {
                    "name": "React JS",
                    "url": ""
                },
                {
                    "name": "Sass",
                    "url": ""
                },
                {
                    "name": "TMDB API",
                    "url": ""
                }
            ],
            "designing": [
                {
                    "name": "Adobe XD",
                    "url": ""
                },
                {
                    "name": "Adobe Illustrator",
                    "url": ""
                }
            ],
            "backdrop": true,
            "available": true,
            "github": "https://github.com/jmfwdev/react-movie"
        },
        {
            "name": "Capstone Project",
            "overview": "Woocommerce website about a fictional company called, Pacific Peak Adventures, selling tour packages available in British Columbia, Canada.",
            "features": [
                {
                    "name": "WooCommerce",
                    "about": "WooCommerce plugin for wordpress to display products, in this case tour packages.",
                    "reflection": "The plugin makes it easy to put custom and default content for each product to give it a default look whilest others have custom parts."
                }
            ],
            "id": "capstone-project",
            "url": "https://jmfw.dev/capstone",
            "coding": [
                {
                    "name": "PhP",
                    "url": ""
                },
                {
                    "name": "Sass",
                    "url": ""
                },
                {
                    "name": "MySql",
                    "url": ""
                }
            ],
            "available": true,
            "backdrop": false,
            "github": "https://github.com/htpwebdesign/pacificpeak-theme"
        }
    ],
    "contacts": [
        {
            "name": "email",
            "content": "jm.hore31@gmail.com"
        }
    ]
}